/*这是C语言阶段考的一道题目，对于一串字符，提取其中的数字。
要求：1.开头遇到空格要跳过。2.开头遇到'+'或'-'就当作符号。3.遇到非数字就结束。（看成了提取其中的数字，本题就是是简化了）
*/
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int n=0,s=1;
    char c;
    c=getchar();
    while(c=='')            //对于开头是空格就跳过。
    {
        c=getchar();        //开头是空格不能忽视，要表达出来。
    }
    if(c=='+')
        s=1;                //用好标志量，而不是用体积很大的条件分支。这一点很重要，以后要多用。
    else if(c=='-')
        s=-1;               //用一个标志变量来存储+1和-1来决定最后输出的数正负号，而不是对最后的printf进行条件分支(麻烦至极)。
    while(c!='\n')          
    {
        if(c<'0'||c>'9')
        break;
        n=n*10+c-'0';       //将一个一个提取出来的数字整合为一个多位整数的算法，而不是用数组一个一个存数字然后再*10^n(极其笨的方法)。
        c=getchar();
    }
    printf("%d",s*n);
    return 0;
}
