
int [5] b[]; ----> int b[][5]; b是存放含5个元素的以为数组的二维数组；
      数组名b依然是一个数组的起始地址；
      b的地址类型是一个抽象的一维数组地址类型，即b+1,b+2为行地址；
      （想要知道一个地址变量是什么地址类型，令它+1之后看朝哪类地址变换）
      *（b[0]+1）即b[0][1]，和*（*（b）+1）一样；
      *(b+1)即b[1],为行地址；
      *（b）即地址类型转换，将行地址转为列地址，&b[0]即b；
二维数组指针的构造过程：
      int [5] *p; ----> int (*p) [5];  p是指向抽象一维数组的变量；
      int c[4][5]; p = c;
      

{
    int n;
    double (*grade) [5];
    grade = (double (*)[5])calloc(n,5*sizeof(double));
    scanf("%d",&n);
}
和
{
    int n;
    scanf("%d",&n);
    double grade[][5];
}
效果一样，前者为动态空间分配；
char (*p)[20];指向二维数组的指针，即指针的指针；
char * p[20]; 数组里放的是指针；
