1.printf 输出时 \" 表示"     \\表示\   %%表示%
2."字符"的输入和输出：
    定义 char ch;
    1)scanf("%c",&ch);  不会跳过空白字符，若第一个输入字符是" ",则存储在 ch 里字符就是空格；
    2)getchar()是读入一个字符并将其返回，所以必须使用赋值将其存储在变量中：ch=getchar();   返回的是int型数值，同时也不会跳过空格；
            示例：while((ch=getchar())==' ') ;   //此语句将把第一个非空格字符存储在ch中；
3.bool型函数返回值应该是true或false；不是0或1；
4.数组作参数：
       定义：int func(int a[])  //通常不说明数组长度；
       声明：int func(int [])  //简写形式；
       使用：    func(b);     //使用时没有[];
5.字符串
    1)'\0' 和 NULL(大写) 暂时先看成是一样；
    2)定义：   char *p; p="abc";       
               *p="def";//用指针定义不能够修改；
              char p[]="abc";//可以修改；若char p[100]="abc";那么余下的空间全是'\0';


    
